In [30]:
import pandas as pd
import numpy as np

In [3]:
df_y = pd.read_csv('y_train.csv')
df_y.tail(3)

     user_id  label
491    41611    0.0
492     2526    0.0
493    30390    0.0

In [35]:
df_y.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 494 entries, 0 to 493
Data columns (total 2 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   user_id  494 non-null    int64
 1   label    494 non-null    float64
dtypes: float64(1), int64(1)
memory usage: 7.8 KB

In [21]:
df_demo = pd.read_csv('demo.csv')
df_demo.tail(3)

,user_id,account_start_date,birth_year,gender,marital_status,family_income_segment_code,individual_income_segment_code
52759,14627,1955-01-20,1930.0,M,3,06,02
52760,34018,1968-05-24,1929.0,M,1,06,04
52761,36321,1980-09-15,1962.0,M,1,,07

In [36]:
df_demo.replace('', np.nan, inplace=True)

In [32]:
df_demo.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 52762 entries, 0 to 52761
Data columns (total 7 columns):
 #   Column                          Non-Null Count  Dtype
---  ------                          --------------  -----
 0   user_id                         52762 non-null  int64
 1   account_start_date              52762 non-null  object
 2   birth_year                      52762 non-null  float64
 3   gender                          52762 non-null  object
 4   marital_status                  40467 non-null  object
 5   family_income_segment_code      45940 non-null  object
 6   individual_income_segment_code  49563 non-null  object
dtypes: float64(1), int64(1), object(5)
memory usage: 2.8+ MB

In [7]:
df_demo['gender'] = df_demo['gender'].astype(str)
df_demo['marital_status'] = df_demo['marital_status'].astype(str)
df_demo['family_income_segment_code'] = df_demo['family_income_segment_code'].astype(str)

In [8]:
df_cardinfo = pd.read_csv('card_info.csv')
df_cardinfo.tail(3)

       user_id  bill_cyc  cr_lmt_amt  card_no
60293    52759      16.0     1250000    60293
60294    52760      11.0     1078000    60294
60295    52761      13.0      293000    60295

In [9]:
df_cardinfo.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 60296 entries, 0 to 60295
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   user_id     60296 non-null  int64
 1   bill_cyc    60296 non-null  float64
 2   cr_lmt_amt  60296 non-null  int64
 3   card_no     60296 non-null  int64
dtypes: float64(1), int64(3)
memory usage: 1.8 MB

In [10]:
df_cctxn = pd.read_csv('cc_txn.csv')
df_cctxn.tail(3)

               mcc      txn_dt  user_id   txn_amt  card_no
3223072   mcc_cat3  2017-03-22    35306   31265.0  41396.0
3223073  mcc_cat11  2017-04-01    37777   11044.0  44154.0
3223074   mcc_cat2  2017-03-03    30668  114966.0  36159.0

In [11]:
df_sabal = pd.read_csv('sa_bal.csv')
df_sabal.tail(3)

        user_id  mm  max_sa_bal
633141    52761   7    165959.0
633142    52761   8      6118.0
633143    52761   9         0.0

In [12]:
df_dtxn = pd.read_csv('dtxn.csv')
df_dtxn.tail(3)

        user_id  mm  amt_in   amt_out
490596    52761   6  1306.0   37114.0
490597    52761   8     0.0  108236.0
490598    52761   9     0.0   88520.0